app/controllers/clients_controller.rb

INSERT INTO "clients" ("encrypted_password", "created_at", "updated_at", "password_salt", "email") VALUES('', '2010-06-18 08:48:02', '2010-06-18 08:48:02', '', '')
---
  def create
    client = Client.create