app/controllers/games_controller.rb

  def create
    game = Game.new(:opponent_id => params[:opponent_id], :is_accepted => false)
    game.challenger = current_client
    if !game.save
      flash[:already_challenged_that_user] = true
    else
      Play.create(:client => current_client, :play => params[:play], :game => game)
---
INSERT INTO "clients" ("encrypted_password", "created_at", "updated_at", "password_salt", "email") VALUES('', '2010-06-25 08:04:57', '2010-06-25 08:04:57', '', '')
INSERT INTO "plays" ("play", "created_at", "updated_at", "client_id", "game_id") VALUES('rock', '2010-06-25 09:02:42', '2010-06-25 09:02:42', 1, 1)