app/controllers/games_controller.rb

SELECT "games".id FROM "games" WHERE ("games"."opponent_id" = 'bar' AND "games"."challenger_id" = 'foo') LIMIT 1
INSERT INTO "games" ("challenger_id", "created_at", "updated_at", "is_accepted", "opponent_id") VALUES(3, '2010-06-08 08:23:07', '2010-06-08 08:23:07', NULL, 4)
---
  def create
    if Game.exists?(:challenger_id=>params["challenger_id"], :opponent_id=>params["opponent_id"])
    then
      game = Game.find(:first, :conditions=>{:challenger_id=>params["challenger_id"], :opponent_id=>params["opponent_id"]})
    else
      game = Game.create(:challenger_id=>params["challenger_id"], :opponent_id=>params["opponent_id"])

SELECT * FROM "clients" WHERE ("clients"."id" = 1) LIMIT 1
---
  def new
    @opponent = Client.find_by_id params["opponent_id"]

SELECT * FROM "games" WHERE ("games"."id" IS NULL) LIMIT 1
---
  def accept
    game = Game.find_by_id(params["game_id"])

SELECT * FROM "games" WHERE ("games"."id" IS NULL) LIMIT 1
---
  def show
    @game = Game.find_by_id(params["id"])